app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "movies" SET "title" = ?, "rating" = ?, "release_date" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "Mockmovie"], ["rating", "PG"], ["release_date", "2022-02-22 00:00:00.000000"], ["updated_at", "2019-03-08 05:25:02.295108"], ["id", 1]]
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]
---
  def same_director
    @movie = Movie.find(params[:id])
    director = @movie.director
    if director && !director.empty? then
      @movies = Movie.where(Director: director)